Обработки/Reports/_ЗапросДУПоИнструменту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ЗапросДУПоИнструменту</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
						<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ЗапросДУПоИнструменту/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СОБЫТИЯ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период = ТекущаяДата();
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
		
	Отчет.Депозитарий = ОбщегоНазначения.ПолучитьИменованныйОбъект("Депозитарий_БК_Регион");
	
	ШаблонПисьма = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("ШаблонПисьма");
	
	УстановитьСвязиПараметровВыбораАктива();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Результат.ИспользуемоеИмяФайла = "Запрос ДУ за " + Формат(Отчет.Период, "ДЛФ=DD");
		
КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	Элементы.Результат.ИспользуемоеИмяФайла = "Запрос ДУ за " + Формат(Отчет.Период, "ДЛФ=DD");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаСервере
Процедура ЭмитентПриИзмененииНаСервере()
	
	УстановитьСвязиПараметровВыбораАктива();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭмитентПриИзменении(Элемент)
	
	ЭмитентПриИзмененииНаСервере();
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
	Этаформа.Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ПодписантДолжность = СтруктураДанныхКонтактногоЛица.Должность;
	ВыбранноеЗначение  = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
		
КонецПроцедуры

&НаКлиенте
Процедура ДепозитарныйСчетПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура АктивПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВWord(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.Подписант) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран подписант");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.КаталогДанных) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан каталог для сохранения файла");
		Возврат;
	КонецЕсли;
	
	// Если отчет неактуален, сформируем заново
	Если Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность	Тогда
		СкомпоноватьРезультат();
	КонецЕсли;	
	
	ВысотаТаблицы = Результат.ВысотаТаблицы;
	Если ВысотаТаблицы <= 2 Тогда		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствуют данные для сохранения");
		Возврат;
	КонецЕсли;
	
	ШиринаТаблицы = Результат.ШиринаТаблицы;
	
	ОбщиеДанные = ПолучитьОбщиеРеквизиты();
	
	ИмяФайлаШаблона = ПолучитьИмяВременногоФайла("docx");
	ШаблонПисьма.Записать(ИмяФайлаШаблона);
	
	Отказ = Ложь;
	Попытка
		
		WordApp = Новый COMОбъект("Word.Application");
		WordApp.Application.Visible = Истина;		
						
		NewDoc = WordApp.Application.Documents.Add(ИмяФайлаШаблона, False, , True);
		
		WordVars = NewDoc.Variables;
				
		Для Каждого Реквизит Из ОбщиеДанные Цикл			
			WordVars.Item(Реквизит.Ключ).Value = Реквизит.Значение;
		КонецЦикла;
		
		NewDoc.Fields.Update();
		
		СчетаДЕПО = Новый Массив;
		
		WordTable = NewDoc.Application.ActiveDocument.Tables(1);
		WordRows = WordTable.Rows;
		Для НомерСтроки = 3 По ВысотаТаблицы Цикл
	                            		
			BeforeRow = WordRows.Item(НомерСтроки);
						
			Если НомерСтроки < ВысотаТаблицы Тогда
				WordRows.Add(BeforeRow);
			КонецЕсли;
						
			Для НомерКолонки = 1 По ШиринаТаблицы Цикл 
				
				InRow = WordRows.Item(НомерСтроки);	
				
				ТекОбласть = Результат.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
				ТекЗначение = СокрЛП(ТекОбласть.Текст);			
				
				// Номер счета ДЕПО
				Если НомерКолонки = 5 Тогда
					Если СчетаДЕПО.Найти(ТекЗначение) = Неопределено Тогда
						СчетаДЕПО.Добавить(ТекЗначение);
					КонецЕсли;
				КонецЕсли;
				
				InRow.Cells(НомерКолонки).Select();
				NewDoc.Application.Selection.InsertAfter(ТекЗначение);
				
				WordTable.Rows(НомерСтроки).AllowBreakAcrossPages = False;
				
			КонецЦикла;   
			     		
		КонецЦикла;   	
		
		WordTable.Borders.InsideLineStyle = 1;
		
		WordVars.Item("СчетаДЕПО").Value = ?(СчетаДепо.Количество() = 1, "счету ДЕПО ", "счетам ДЕПО ") + РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(СчетаДЕПО, ", ");
		
		NewDoc.Fields.Update();
						
		ТекИмяФайла = "Письмо_" + Формат(Отчет.Период, "ДФ=dd.MM.yyyy") + ".docx";
		NewDoc.SaveAs(Отчет.КаталогДанных + "\" + ТекИмяФайла);	                
				
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);	
				
	КонецПопытки;
	 	
	// удалим файлы шаблона
	Попытка
		УдалитьФайлы(КаталогВременныхФайлов(), ИмяФайлаШаблона);
	Исключение
	КонецПопытки;
	
	Если Отказ Тогда
		ПоказатьПредупреждение(,"Формирование отчета в Word завершилось с ошибкой!");
	КонецЕсли;
	     
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Диалог.Каталог            = Отчет.КаталогДанных; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда 
		Отчет.КаталогДанных = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Отчет.КаталогДанных + "\");

КонецПроцедуры


#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура УстановитьСвязиПараметровВыбораАктива()
	
	МассивСвязей = Новый Массив();
		
	Если ЗначениеЗаполнено(Отчет.Эмитент) Тогда
		
		НовыйОтбор = Новый СвязьПараметраВыбора("Отбор.Эмитент", "Отчет.Эмитент", РежимИзмененияСвязанногоЗначения.Очищать);	
		МассивСвязей.Добавить(НовыйОтбор);
			
	КонецЕсли;
	
	ФиксМассив = Новый ФиксированныйМассив(МассивСвязей);		
	Элементы.Актив.СвязиПараметровВыбора = ФиксМассив;

КонецПроцедуры

&НаСервере
Функция ПолучитьОбщиеРеквизиты()
	
	Реквизиты = Новый Структура("НаименованиеУК, Подписант, ПодписантДолжность", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК НаименованиеУК
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО Организации.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	Организации.Ссылка = &Организация";
	                       
	Запрос.УстановитьПараметр("Период", Отчет.Период);
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Подписант) Тогда
		Реквизиты.Вставить("Подписант", СокрЛП(ЭтаФорма.Подписант));
		Реквизиты.Вставить("ПодписантДолжность", СокрЛП(ЭтаФорма.ПодписантДолжность));
	КонецЕсли;
	
	Возврат Реквизиты;
	
КонецФункции // ПолучитьОбщиеРеквизитыДляПечати

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
